name: "general_prep"
backend: "python"
max_batch_size: 0

input [
  { name: "bin_images", data_type: TYPE_STRING, dims: [ -1] },
  { name: "params", data_type: TYPE_STRING, dims:[ 1 ], optional: true }
]
output [
 { name: "prep_image", data_type: TYPE_FP32, dims: [ -1, -1, 3 ] },
 { name: "prep_params", data_type: TYPE_STRING, dims: [ -1 ] } 
]
instance_group [ { count: 1, kind: KIND_CPU } ]
