name: "image_decode"
backend: "dataelem_python"
max_batch_size: 0

parameters { key: "algorithm_type" value: { string_value: "ImageDecode" } }

input [
    {
        name: "image_b64"
        data_type: TYPE_STRING
        dims: [ 1 ]
    }
]

output [
    {
        name: "image",
        data_type: TYPE_FP32,
        dims: [ -1, -1, 3 ]
    }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]
